# # Installation dependencies and settings
# -----------------------------------------------------------------------------
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Programming languages
# -----------------------------------------------------------------------------
brew "bash"
brew "node"
brew "sbcl"
brew "tcl-tk"

# Programming language managers
# -----------------------------------------------------------------------------
brew "nodenv"
brew "rbenv"

# Database
# -----------------------------------------------------------------------------
brew "postgis"
brew "postgresql@14"
brew "sqlite3"

# CLI Tools or other end-use software
# -----------------------------------------------------------------------------
brew "asciinema"
brew "awscli"
brew "bcrypt"
brew "btop"
brew "darkhttpd"
brew "difft"
brew "direnv"
brew "fd"
brew "ffmpeg"
brew "fzy"
brew "gh"
brew "git"
brew "groff"
brew "gron"
brew "imagemagick"
brew "ouch"
brew "prettier"
brew "pwgen"
brew "recutils"
brew "redis"
brew "rg"
brew "rlwrap"
brew "rsync"
brew "sdcv"
brew "shellcheck"
brew "vim"
brew "weechat"
brew "wget"
brew "yarn"

# Interactive fiction
# -----------------------------------------------------------------------------
brew "frobtads"
brew "frotz"
brew "glulxe"

# Cask applications
# -----------------------------------------------------------------------------
cask "audacity"
cask "chromedriver"
cask "docker"
cask "google-chrome"
cask "hammerspoon"
cask "ghostty"
cask "mullvadvpn"
cask "postico"
cask "slack"
cask "vlc"
cask "zoom"
