# # Installation dependencies and settings
# -----------------------------------------------------------------------------
cask_args appdir: "/Applications"

# Shell
# -----------------------------------------------------------------------------
brew "bash"

# Programming language managers
# -----------------------------------------------------------------------------
brew "mise"

# Database
# -----------------------------------------------------------------------------
brew "sqlite3"

# CLI Tools or other end-use software
# -----------------------------------------------------------------------------
brew "asciinema"
brew "awscli"
brew "bcrypt"
brew "btop"
brew "curl"
brew "darkhttpd"
brew "difftastic"
brew "direnv"
brew "fd"
brew "ffmpeg"
brew "fzy"
brew "gh"
brew "git"
brew "groff"
brew "gron"
brew "imagemagick"
brew "ouch"
brew "parallel"
brew "prettier"
brew "pwgen"
brew "recutils"
brew "redis"
brew "rg"
brew "rlwrap"
brew "rsync"
brew "sdcv"
brew "shellcheck"
brew "vim"
brew "weechat"
brew "wget"
brew "yarn"

# Interactive fiction
# -----------------------------------------------------------------------------
brew "frotz"
brew "glulxe"

# Cask applications
# -----------------------------------------------------------------------------
cask "audacity"
cask "chromedriver"
cask "docker"
cask "google-chrome"
cask "hammerspoon"
cask "ghostty"
cask "mullvadvpn"
cask "postico"
cask "slack"
cask "vlc"
